trade_exp/src/Documents/ИнвентаризацияКодовМаркировки/ИнвентаризацияКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="beae7a26-d6d6-4142-bb30-26b17736626f">
  <name>ИнвентаризацияКодовМаркировки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e189fbd9-27e5-4094-a288-984dde9e7ab3">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b878e10-0e77-4909-9727-17fedfce702c">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="52ec7a11-1b76-41c6-89cb-840ea19157e3">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="96c3883d-ccd8-4002-bccd-cce5b390a5cb">
    <name>ТочкаПересчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b82ff1c-c3c3-47ec-b342-5204d669c322">
    <name>ТолькоМТ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="b29eabaa-9b73-4dc8-b618-da6693a86435">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bb4e1dd0-f4dd-49fb-8ece-795a67b179bd">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4decde9e-d754-4b2d-8c86-c1663927c891">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09e9c182-6c51-4a37-aec2-c5479ba3ab05">
      <name>КодМаркировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cbb00ee6-ec54-4a55-b45f-054f8f067180">
      <name>ПоУчету</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9f9255d4-f8bd-4641-b091-7b5da6f7aae4">
      <name>ПоФакту</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93a49517-3e01-4120-9e29-f50a8cfc3430">
      <name>ВНаличии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f9bf716a-69a5-4716-90b2-ad84bf304321">
      <name>Отклонение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ДвижениеМаркированногоТовара/ДвижениеМаркированногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="70d56e94-a86d-4915-92a5-6167bd5f744b">
  <name>ДвижениеМаркированногоТовара</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="9ef50358-4b4c-4f8d-8f3c-c39ae0f8284a">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="27a718ab-e501-4f96-a32f-314d4c6668c8">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="22aee441-98fe-4f62-a188-d07f0fc890a6">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="02701afa-eb9c-4ab0-83ef-0735eb368b9b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce0c1123-07f1-40d4-936e-14f1e588c802">
    <name>ШтрихкодУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ИнвентаризацияКодовМаркировки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		Неопределено,
		ЭтотОбъект,
		"СканерШтрихкода,ФискальныйРегистратор");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
		// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураДанных= МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= СокрЛП(СтруктураДанных.Штрихкод);
			ОбработатьШтрихкоды(Штрихкод);
	КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьПоОтбору(Команда)
	ЗаполнитьПоОтборуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныеШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныеШтрихкода);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкодов) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();

	ОбработатьШтрихкодыСервер(ДанныеШтрихкодов);
	
	//ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(ДанныеШтрихкодов)
	
	НайденнаяСтрока=Объект.Товары.НайтиСтроки(Новый Структура("КодМаркировки",ДанныеШтрихкодов.Штрихкод));
	если НайденнаяСтрока<>НЕОПРЕДЕЛЕНО тогда
		НайденнаяСтрока[0].ВНаличии=1;
	иначе
		//ОбщегоНазначения.СообщитьПользователю();
	конецесли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОтборуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Размещение.Ячейка КАК Ячейка,
		|	Движение.Штрихкод.Номенклатура КАК Номенклатура,
		|	1 КАК ПоУчету,
		|	-1 как Отклонение,
		|	Движение.Штрихкод.ЗначениеШтрихкода КАК КодМаркировки
		|ИЗ
		|	РегистрНакопления.ДвижениеМаркированногоТовара.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Склад = &Склад) КАК Движение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Размещение
		|		ПО (Размещение.Номенклатура = Движение.Штрихкод.Номенклатура)
		|			И Движение.Склад = Размещение.Склад
		|			И (Размещение.ОсновнаяЯчейка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Размещение.Ячейка,
		|	Движение.Штрихкод.Номенклатура,
		|	Движение.Штрихкод.ЗначениеШтрихкода";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
#КонецОбласти
